[
  {
    "rating": 5,
    "title": "I have found Mendi to be exceptionally…",
    "review": "I have found Mendi to be exceptionally beneficial in managing my focus and anxiety. The product itself is user friendly and highly effective. The customer service provided has been excellent whenever I've required assistance. I highly recommend that individuals consider incorporating this into their routine for a few months to experience its potential impact. This is not a fake review! Lol",
    "date": "2025-07-23T15:20:04.000Z"
  },
  {
    "rating": 2,
    "title": "The price keep going up in the last 3 days. It's over $1,000 now. Unaffordable",
    "review": "The price is going up in the last 3 days from the 19th till the 22nd. It's gone up to over $1,000. Very unaffordable even though it seems like a wise choice. Maybe it's an algorithm that keep running that up. Can you help me? Thank you very much",
    "date": "2025-07-22T21:45:02.000Z"
  },
  {
    "rating": 1,
    "title": "If you return the product they will ghost you and lie.",
    "review": "Tried the product for 3 weeks and did not notice any change to focus, mood, behavior. Decided to return it. We followed all the steps requested including making sure all original items were included in the return (including paper instructions). It was received by mendi on 2/12/2025 and as of 3/28/2025 they are denying the refund stating “merchandise not received.” we have started a dispute with our credit card company and emailed the customer service rep our shipping, tracking and delivery confirmation and they are not responding to me or our credit card provider. Bad business. Do not recommend.",
    "date": "2025-03-29T14:50:06.000Z"
  },
  {
    "rating": 5,
    "title": "Great product positive direction",
    "review": "I was a little skeptical about this product. Especially ordering it from overseas. But I put positive energy into it and decided to trust the process. I have used the mendi at least once every single day after receiving it. At first I was a frustrated because I was getting mixed results. I stuck with it, and kept going. After a few weeks I started getting in the zone. And I have seen and felt massive improvements in focus, emotional awareness and cognitive clarity.\nThe staff responds quickly and are courteous. Robert was receptive to my request and mentioned that he would pass it along to the correct department. This is a great product it has helped me with my meditation. I believe this will elevate me and anyone willing to stick with it, to the next level. Thank you Mendi team. I am looking forward to more positive options when describing the feelings. Positive people live healthier lives!",
    "date": "2025-03-28T19:13:48.000Z"
  },
  {
    "rating": 5,
    "title": "Mendi device - Truly Impressive!",
    "review": "I have been using the Mendi device for about 2.5 years now, and I have to say—it is truly impressive! I first discovered Mendi as a backer on Kickstarter, intrigued by the idea of making neurofeedback training accessible for home use. Since incorporating it into my routine, I’ve noticed significant improvements in my focus and cognitive endurance. The real-time feedback feature is especially valuable, providing clear guidance on optimizing training for better results. Additionally, the gamified approach keeps sessions engaging, making it an effective and enjoyable tool.\n\nI’m excited to continue using Mendi to further enhance my focus and mental well-being. My coworkers at the hospital have also taken a keen interest in it. In such a high-stress environment, they appreciate how easy it is to use and how it helps them feel more focused and relaxed. The real-time neurofeedback and interactive training make it both engaging and effective, and many of them are already noticing improvements in their concentration and mental clarity. It’s become a fun yet valuable tool during our breaks.",
    "date": "2025-03-18T21:04:20.000Z"
  },
  {
    "rating": 5,
    "title": "Realist and excellent product",
    "review": "Excellent product. Be warned, this takes persistance in the first three to four weeks. Benefits are slowly accumulated, there's no \"placebo\" hit at all and you'd be forgiven for thinking nothing is happening. Trawl the Facebook group and videos for tips to help.\n\nEffects, for me: after use, all day focus in a complex job, mood uplift, greater fluency when writing.\n\nDon'r focus on scores as long as you, on average, make the score higher at the end than at the start. It is NOT like a game where you get better over time giving higher scores, not the percentage ones at least. Even my poor score days give me the benefits I'm after.\n\nI started last June 2024.",
    "date": "2025-03-10T11:28:59.000Z"
  },
  {
    "rating": 2,
    "title": "Started at 62 for the score",
    "review": "Started at 62 for the score, after a couple weeks the score went to 92. But found if I just put my fingers on the headband and didn’t even watch the ball my score is still 90. Was not overly impressed with this.",
    "date": "2025-03-10T10:49:02.000Z"
  },
  {
    "rating": 1,
    "title": "not working!",
    "review": "hi folks!\n\ni live in the EU and firstly their shipment is pretty long, that is maybe no an issue, but i guess mendi not checking the device before sending, simply their device is not working! as easy like that, cannot connect to any of my devices from phone to pc laptop and etc. thendo not say why to buy from China! yea at least their stuffs are working tho!",
    "date": "2025-02-07T16:17:11.000Z"
  },
  {
    "rating": 5,
    "title": "Impeccable Customer Service",
    "review": "For various reasons, was only able to use the product a few times during the 30 day return window. This may be why I didn’t feel much effect. I decided to return it, and was very pleasantly surprised by the impeccable customer service that made the return so easy, and the refund to my account so timely. I could well try again some time and give it more of a fair trial.",
    "date": "2025-02-01T05:45:35.000Z"
  },
  {
    "rating": 3,
    "title": "I deeply regret buying this",
    "review": "Update: After consideration, I'm adding 2 stars. The product is still 1 star in my book, but I think the company is generally trying to do good business, they are just really bad at it, in my opinion.\n\nUpdate: I still regret this purchase and the whole rigermarole of return has been a joke. That said, the company did contact me and I did get the full refund. The shipping label cost was not deducted, so they did pay the return shipping, which is a big deal. It is confusing because they say you are responsible for shipping costs in some parts so it was unclear, but they did cover the cost. They also asked that I clarify that customer service did respond to inquiries for return, which is true, however, I stand by my statement that I emailed someone outside CS (who had sent an email after my order) when it was over a week late, and I received no response. I still can't recommend the product or company. But in mind they went from a -3 to a 1 star for at least responding to my concerns and getting my refund processed.\n\nOriginal: I deeply regret buying this. It didn't work as advertised (small example, the ball actually goes higher almost everyone every time some one starts taking to the user, distracting them, supposedly indication of better focus). The app was glitchy and didn't work correctly (or completely froze) half the time. It came late so wasn't on time for a Christmas present and I got no response from the company. Returning in the 30 day period is insanely difficult, customer non responsive, and then, salt in the wound, I have to pay to ship it Estonia which will be extremely expensive. I suspect the positive reviews are all fakes. Buyer beware!!",
    "date": "2025-01-09T20:41:14.000Z"
  },
  {
    "rating": 5,
    "title": "I've been using the device for over 3 months",
    "review": "I've been using the device for over three months now and have noticed significant improvements in focus and mindfulness.\n\nMy three kids also enjoy the sessions and are highly motivated to use it regularly. The device offers great value, a simple interface, and measurable results.\n\nI would highly recommend it to anyone looking for an affordable yet effective solution to enhance concentration and overall mental health.\n\nAdditionally, the support team was amazing—quick, accurate, and genuinely helpful.\n\nGreat work! Thank you.",
    "date": "2024-12-06T08:27:14.000Z"
  },
  {
    "rating": 5,
    "title": "I really love using my Mendi!",
    "review": "I really love using my Mendi and can say it has made a positive impact on my day to day!\n\nI've been using it for about three years. I tend to have good streaks lasting about a month, and then I take a small pause, and come back to it again for another month. Mendi has definitely helped me strengthen my \"focus muscle\". I feel very fortunate to have come across this technology. Thank you, Mendi team!",
    "date": "2024-11-12T11:30:50.000Z"
  },
  {
    "rating": 1,
    "title": "Cheap fake headset duped into paying a…",
    "review": "Cheap fake headset duped into paying a fortune for a device that is just basically a headset with a red light and a bogus score based on concentrating on watching a ball move across the screen.\nI am guessing the company paid a lot for suspect reviews.\nHow it can detect brainwaves is a complete mystery, the red light is certainly not a sensor it works without being placed on the head and just laid on a table.\nMaybe this should be aimed at young children as opposed to people who wish to improve their focus and sleep.\n4 different people in my family tested this device and guess what we all achieved a score of 62% focus, the odds of this happening is impossible!\nIt is very disappointing that this device is being aimed at people who are ill with symptoms of ADHD & PTSD etc, when in reality it is just a cheap toy. Making money out of sick people is shocking.",
    "date": "2024-09-30T11:21:09.000Z"
  },
  {
    "rating": 5,
    "title": "An Accessible and Promising Solution in Real-Time Neuro-Feedback and Brain Training",
    "review": "As a specialist in Mental Health, Psychotherapy, Psycho-Sexology, and Sexology, I have both the interest and the ethical obligation to stay informed about new technologies that influence people’s lives, whether they have a positive or negative impact. It's especially crucial to remain updated on innovations that can contribute to health and overall well-being.\n\nReal-time Neuro-Feedback and Brain Training technologies are generally quite expensive, sometimes even prohibitively so. In this context, Mendi stands out by offering an accessible solution with an excellent price-to-quality ratio, making it the most affordable device of this type that I have encountered so far.\n\nI have been testing the Mendi device for over two months, and the results have been very promising. In my approach, I always start with thorough research, followed by personal testing, and then applying it to larger groups. So far, Mendi has pleasantly surprised me with its ease of use and the consistency of results achieved with regular training.\n\nWe live in an era where technology plays a central role in our lives and evolves extremely rapidly, often in ways we do not fully recognize, and sometimes not at all. Real-time Neuro-Feedback and Brain Training devices have already become a less recognized necessity because there are many negative factors in our technological environment that can affect mental and cognitive health. Mendi offers an effective way to train the brain and harness neuroplasticity to counteract these negative influences, similar to how we care about exercise and nutrition to maintain a healthy and fulfilling life.\n\nAnother aspect that deeply impressed me was my interaction with the Mendi Team. In a field where communication with manufacturers is often difficult, I was surprised by their warmth, kindness, and extraordinary availability. The Mendi team was incredibly responsive and prompt in addressing all my requests, and this human openness and attention to detail make me appreciate that I have encountered an exceptional, passionate, and dedicated team. This gives me confidence in a beautiful, beneficial, and lasting collaboration. Honestly, when I meet such people, I feel blessed, and I am confident that the future is in good hands.",
    "date": "2024-08-27T20:45:03.000Z"
  },
  {
    "rating": 5,
    "title": "I’ve used Mendi to help restore memory…",
    "review": "I’ve used Mendi to help restore memory loss from long COVID and for PTSD and depression.\n\nBefore I tried TMS that seemed miraculous in that I felt like I was waking up but had another covid infection that took me back to pre TMS status. My husband and I both did another 7week, 5 days week TMS round about a year later and gained nothing from it. TMS was also very expensive even with insurance.\n\nSaw a piece on the Mendi unit on TV used on a child for ADHD and how well it worked for him and he’s now off ADHD meds. Mendi also states it helps heal\nThe damaged neuropathways same as TMS. I researched online on several different sites for neuro feedback and found it was also in trials for PTSD and depression so my husband bought one (we can both use it). The app is free.\n\nI have noticed a marked improvement in memory, both recall and long term memory issues. I’m calmer and can handle situations that would normally stress me out in a more rational way. My depression issues have improved but not disappeared. When I sleep, it’s deeper and more refreshing.\n\nAs an avid reader, Covid took my ability to concentrate and read a book without going over the last 10-20 pages several times so I just quit trying. After using Mendi for about a month I gave reading another try and finished an entire book without having to reread anything and still remember what I read even after 2 months! I’m also a musician (I play at it) and an aspiring artist but have had no desire to engage at all. I’m starting to feel like I want to get back into both.\n\nI’ve been using Mendi every day, sometime twice a day for 75 days as of August 24, 2024. I will continue to use it daily as a boost for my brain health.\n\nIt’s been worth the experiment for me!",
    "date": "2024-08-25T00:32:57.000Z"
  },
  {
    "rating": 5,
    "title": "I did it every morning for months",
    "review": "I did it every morning for months. I got it to help me relax and work on my meditation.\n\nThe music and graphics are wonderfully done. The linking articles are interesting and well worth reading.\nThe device is well packaged and easy to operate.\n\nOne morning while operating the device, I could sense beautiful energy beings in my space and my brain activity soured. I got the \"crown\" and high score. This was proof for me that the device can work. I'm guessing, everyone must be different in their experiences.",
    "date": "2024-09-11T00:57:09.000Z"
  },
  {
    "rating": 5,
    "title": "I want to follow up with a complaint I…",
    "review": "I want to follow up with a complaint I made a few days ago. The customer service people got in touch immediately and resolved the issue. I was quick to criticize without contacting them directly.",
    "date": "2024-08-09T04:17:04.000Z"
  },
  {
    "rating": 5,
    "title": "Traumatic Brain Injury Survivor… I…",
    "review": "Traumatic Brain Injury Survivor… I would like to try this to further my recovery. Please respond. Do you take CalOptima MediCal? Thanks in advance.",
    "date": "2024-07-15T14:23:28.000Z"
  },
  {
    "rating": 5,
    "title": "I started using Mendi August 11,2022",
    "review": "I started using Mendi August 11,2022 , because I was going through a lot of stress, and high blood pressure during school and I was taking oral medication , which helped ,but have lots of side effect, also from time to time I have racing thoughts going through my mind, I saw an advertisement on Facebook about this device and was skeptical , but decided to checked it out, and I bought one and received it 08/11/2022 and that was the best decision that I made ,now I seem to can't live without my Mendi's , whenever I use it I find myself more focus and alert and my blood pressure to be in better shape after I use it, now I no longer take medication for stress I just use my Mendi's, however in June of this year 2024 my Mendi broke ,I reached out to the company and to my surprised they sent me a new Mendi without charging me anything. This is unheard of. Thank you Robert for your kindness.",
    "date": "2024-06-29T19:49:10.000Z"
  },
  {
    "rating": 5,
    "title": "Honorable Fair Customer Service",
    "review": "Honorable Fair Customer Service\nI experienced some trouble with my mendi device. I was a little cynical expecting them to run me through a complicated refurbishment and application process like majority of companies. They did ask me some questions to see what the problem was,but after that it was very easy to get the problem fixed. They responded quickly, acted quickly, and the process was simple. Mendi is a great company.",
    "date": "2024-06-06T03:55:05.000Z"
  },
  {
    "rating": 5,
    "title": "Best customer service in years!",
    "review": "I’m grateful to share an amazing experience I’ve had with Mendi customer service and overall commitment to customers. Upon receiving my Mendi it wasn’t 2 hours later my puppy decided to ruin it. I reached out to Mendi and they kindly sent me a new device. I honestly wasn’t expecting anything but thought I’d ask just in case. When it arrived at my doorstep I was floored. This type of customer service is non existent anymore. It tells me they care about users as well as their product. My autistic son loves the device and uses it frequently. Thank you Mendi!",
    "date": "2024-04-09T12:55:15.000Z"
  },
  {
    "rating": 5,
    "title": "My son loves his Mendi",
    "review": "My son loves his Mendi. He looks forward to using it everyday. Considering he normally has trouble staying focused on tasks, I’m pleased to see him so excited about it. There were some issues with the product and the customer service department handled it promptly and efficiently. I would def recommend to any parent who’s child struggles with focusing.",
    "date": "2024-03-28T21:13:37.000Z"
  },
  {
    "rating": 5,
    "title": "Love my mendi",
    "review": "Mendi has been a game-changer for me.\ni usually do a session before my language course, a 10- minuter feels like chugging a virtual coffee.\nDr Rall’s guides on youtube have been very helpful as well\nthank you for making this tech accessible!",
    "date": "2024-03-14T10:23:17.000Z"
  },
  {
    "rating": 1,
    "title": "It's not Real",
    "review": "My review is about how, unfortunately, the product does not work.\nI know it's a disappointment.\nI will say it DOES work in the sense it gets you to try and practice focusing, which I guess IS the objective, even if the matter in which they're doing it is false.\n\nSo with the Mendi headset the way to manipulate you score is scrunch your brow (like when mad) OR looking up vs down at any given time (you don't need to shake your head).\nWhenever you look up your score will be low... whenever you look down your score will be sky high.\n\nI think what this device measures IS blood flow to your brain (frontal cortex), BUT how much you lean forward is how much \"blood\" is there.\n\nPicturing being hung upside down.. you can really feel where the blood is going to your head (and probably Mendi would tell you you're brain capacity is beyond 100%).\n\nLastly, your score for how you're improving factors heavily into how OFTEN you use it (your streak and what day you are on). So, are you REALLY getting better just because you're using it more often?\nI'd argue someone with a great score, using a new account, would have a bad score because the game is just rewarding you being disciplined and showing up.\n\nI am sorry to be the one to let you down.\nI wish I could post a picture showing you my findings but Trust Pilot does not offer this feature.\n\nSome positives is the music is good, visuals are good, concept it GREAT.\n\n...But it's all fake.",
    "date": "2024-03-13T03:46:03.000Z"
  },
  {
    "rating": 5,
    "title": "Recommended by MLB Psychologists",
    "review": "This product was recommended to me by a, mlb, psychologist to help with focus and neuro feedback.\n\nCustomer service is incredibly helpful and truly cares about their clients. I highly recommended to others who are interested in brain health.",
    "date": "2024-01-18T05:45:49.000Z"
  },
  {
    "rating": 5,
    "title": "me and my mendi-keeps me smart🤩",
    "review": "i am 88and have been using my mendi headband for about five years. It started with a slight time lag in word retrieval.\nBut i know all the other effects of mild\ncognitive impairment are waiting in the wings and i didn't want any of them. So\nfar using mendi sporadically has kept\nmy mind working well. When i feel anything start to slow down I use the mendi daily and it gets back to normal-or even gets better than normal! i absolutely love it and recommend it to people all the time.",
    "date": "2023-12-13T05:17:00.000Z"
  },
  {
    "rating": 4,
    "title": "Customer service is excellent and…",
    "review": "Customer service is excellent and diligent in making sure you get proper help. As for the game, it can get a bit boring but what exercise doesn't? It's good training for your brain. However, there seems to be a bug with android devices where the sessions aren't being logged properly. If not for that issue, I'd give them 4 or 5 stars since it's a good experience. But as of right now, I can't give them higher than 2 stars since not being able to log your sessions defeats a lot of the purpose with the training.\n\nEdit 2023-12-18: The issue seems to have been resolved on the beta version of the app which I'm using, and they have also been regularly updating other bugs that are occurring. But I'm still not sure if the bug has been resolved on the public version of the app. But since it's no longer affecting me and my personal experience, I will change it to 4 stars. I think for me to give it 5 stars, I'd like to see some more variety on games as opposed to just having a single game to play.",
    "date": "2023-12-18T19:58:33.000Z"
  },
  {
    "rating": 1,
    "title": "Useless without a functional Android phone app",
    "review": "I am very disappointed with the Mendi headband due to the malfunctioning app. It was good for a while but the app has been malfunctioning for more than 2 months, and as a result, it does not provide a score after completing a practice session. This means that there is no way to track my progress, and the headband is completely useless without the app. I have contacted the developer team, but they have not been able to fix the problem. I am very disappointed with this product and would not recommend it to anyone until the app is fixed.",
    "date": "2023-11-29T09:43:03.000Z"
  },
  {
    "rating": 5,
    "title": "Life Changing",
    "review": "I have being using the device for just over a week and I'm starting to feel more awake and focused with a greater sense of control and calmness\nI am delighted with this piece of tech",
    "date": "2023-11-30T15:33:59.000Z"
  },
  {
    "rating": 5,
    "title": "Better stress management skills",
    "review": "As a menopausal woman with children in puberty our house sometimes started to feel like a stressful/loud/chaotic place. Having used Mendi almost daily for about a month, I have noticed that other people’s emotions don’t affect me as much as before. This helps enormously with keeping home- and work life more balanced and calm. I also feel like I am more in control of my boundaries and better able to say ‘no’ without feeling stressed about it. I see this tool like ‘meditation on rocket fuel’. Very easy daily 10min practice for (in my opinion) a big result. Definitely worth my money.",
    "date": "2023-10-07T19:35:26.000Z"
  },
  {
    "rating": 1,
    "title": "Fraudulent device",
    "review": "I turned it on and started a session. I placed the headband on the counter. The ball goes up and down as if I had it on. That should be impossible, how could it record brain activity when I don’t even have it on????",
    "date": "2023-08-31T20:26:15.000Z"
  },
  {
    "rating": 2,
    "title": "Fake reviews",
    "review": "Fake reviews! C’mon Mendi, if you are going to write the fake reviews, don’t make them cheesy and obvious that you are writing them! This is plastic headband that does nothing but make you think it works",
    "date": "2023-08-26T21:01:41.000Z"
  },
  {
    "rating": 5,
    "title": "Focus plus other benefits",
    "review": "Mendi is a wonderfully helpful tool to enhance focus, and a number of other mental functions and skills. As with any improvement, consistent practice is critical. Once you get into the routine of spending even a daily 5 minutes using the Mendi, the results do begin to show up. No doubt, they are a little different for each person, but reading the comments from others, and comparing that to my own experience, one of the key benefits is greater ease and quality in one's focus. That by itself has lots of \"spill over\" benefits to other parts of your life. Also, I have found the Mendi team to be very customer focused. Keep enhancing this excellent tool!",
    "date": "2023-07-15T22:14:03.000Z"
  },
  {
    "rating": 5,
    "title": "I love Mendi",
    "review": "I love Mendi! It's a remarkable technology, and I also love the story behind why CEO Moha Bensofia invested in it after healing from PTSD by using it. It drew me in, but I also muscle tested myself for it, and I considered many other products out there. After 8 days of Mendi utilization, I can feel the changes in my brain -- better focus, better breathing, better life.\n\nI've only begun to experience the benefits, yet if I experienced no more, it was worth the relatively small cost. It'll be worth more and more as I go, so if you're considering buying it, just do it!\n\nWhether you have done traditional neurofeedback or not, this is a pivotal tool. You can do it daily (or even multiple times a day), and you can experiment with variables (supplementation, meditation practices, time of day usage, etc) too maximize the effectiveness of the sessions. This is hard to do when you're going to a center/storefront for neurofeedback. It doesn't replace it, but it's a wonderful tool.",
    "date": "2023-07-08T17:18:00.000Z"
  },
  {
    "rating": 5,
    "title": "A great product with great people behind it",
    "review": "The gadget is very effective yet simple to set up and use right away. More importantly, the after-sales support from the communication and community team is fantastic. Robert Rtveliashvili took time to patiently explain in detail the best way to use Mendi and also recommended useful resources for further exploration. Mendi is a winner not just because its a great product but there are also great people behind it - in creating the product and being with the users after its sold.",
    "date": "2023-06-02T14:01:24.000Z"
  },
  {
    "rating": 5,
    "title": "I really recommend Mendi for anyone…",
    "review": "I really recommend Mendi for anyone that’s struggling with anxiety, stress, migraine, or even when you feel your head heavy and full after after a long day. I’ve been using Mendi for a week and I already can feel the difference on my ability to concentrate, stress relief and better mood. It’s incredible how it can just turn a stressful mind/mood into a better mood and light head in 15 minutes . I love it!",
    "date": "2023-05-02T10:06:49.000Z"
  },
  {
    "rating": 5,
    "title": "Mendi it’s awesome 😎",
    "review": "Mendi is beyond any devices to help with neurofeedback. I’m on a 28 day streak with my headband and I feel many things are changing. For example how I react to different emotions and situations in a comer manner. Neuroplasticity is possible with Mendi because you get instant biofeedback with the Mendi device and the app. Easy to use and happy to have Mendi in my life. Another important detail, my 2 daughters and wife are also using Mendi.",
    "date": "2023-04-26T20:20:27.000Z"
  },
  {
    "rating": 5,
    "title": "Helpful device for lifestyle improvement",
    "review": "Very helpful device on the road towards better mental health. Not a one-stop solution, but great addition to a changed lifestyle to make life more calm and harmonic. I recommend everyone to try it for a couple of weeks and see if they get the same results as I have.",
    "date": "2023-03-30T11:53:35.000Z"
  },
  {
    "rating": 5,
    "title": "Not just another device 🫶",
    "review": "Mendi helped me control my emotions, and deal with anxiety, as well as significantly reduced my level of stress. I noticed a change already after 4 weeks of using it on a daily basis. At this point, after 8 months, I consider myself a pro user 😎\nI strongly recommend daily usage and experimenting with times and the length of training in order to find the best solution for yourself.\nMy training routine is 15 min every morning within 30 min of being awake and before coffee.\nTry it out - the worst thing that can happen to you is that you trusted a lady that wrote a killer review 😁",
    "date": "2023-03-29T18:49:43.000Z"
  },
  {
    "rating": 1,
    "title": "Really just a fraudulent device",
    "review": "Really just a fraudulent device. A student brought this into our lab and we pieced the hardware and data apart. Cheap Chinese tech from decades ago with nothing really to say about your brain. Mendi is not a headset company they are a marketing company for getting people to buy this stuff and show them nonsensical graphs regarding brain blood flow.\nClassic placebo marketing making a quick buck! Many have and will do the same I'm sure.",
    "date": "2023-03-28T22:32:51.000Z"
  },
  {
    "rating": 5,
    "title": "Its great to go \"have I done my Mendi today?\"",
    "review": "We only just got our Mendi a few days ago but its been a really fun way to enter the world of neural feedback.\n\nMy wife loves it and is already doing really well.\n\nIt's early days yet and I'll update after using it for the 28 days to get my benchmarks",
    "date": "2023-03-25T06:31:43.000Z"
  },
  {
    "rating": 5,
    "title": "It's been less than a week & I have…",
    "review": "It's been less than a week & I have already noticed a huge difference in my focus & ability to manage stress. I am someone who has had bad anxiety, difficulty focusing & trouble sleeping. Since using Mendi for the last few days I have already noticed a big difference over all! Excited to see my results continue!",
    "date": "2023-03-25T06:13:53.000Z"
  },
  {
    "rating": 5,
    "title": "I bought the Mendi device after hearing…",
    "review": "I bought the Mendi device after hearing about it on Dave Asprey's podcast and I really love it - Great device!\n\nI'm honestly blown away how much more focused I am and how I don't get distracted as easy as before. Will continue to use it every single day!",
    "date": "2023-03-24T12:43:31.000Z"
  },
  {
    "rating": 5,
    "title": "Great company, customer service A+",
    "review": "Great company, super helpful when I needed assistance with my order. Quick to reply and very helpful. Product is great too.",
    "date": "2023-03-22T22:49:50.000Z"
  },
  {
    "rating": 2,
    "title": "Doubtful if it works - broken after 11 weeks",
    "review": "The good stuff:\nMendi is a nicely design product, and the whole ecommerce experienced worked very well. The app in itself is pretty nice, and the \"game\" is very well designed which makes it kind of fun to play.\n\nMy doubts:\nI was quite invested in trying out the product but I couldn't help but wondering if it actually has any effect. It says in the app that you should experience some effect after 6-8 weeks. I used the product 3-5 times per week for 11 consecutive weeks but I can't say that I experienced any effect. It does measure something, that much I can say, but I'm not sure that the \"exercise\" actually has any effect. I did become better at the game in the first weeks, but then it pretty quickly levelled out, and I didn't experience any other effect. If the device didn't break down (more in next paragraph) I would probably keep using it for a while longer to see if there would be any effect, but at this point in time I would not recommend it to a friend.\n\nThe bad stuff:\nIt loses connection quite a lot which is a bit annoying. It seemed to get worse over time.\nWhat's worse, after 11 weeks, it stopped charging and is now completely dead. It has amazing battery time, so it was actually only the third or fourth time I charged it. I find this disappointing in terms of quality.\n\nSo all in all, a nice device that probably doesn't do anything, and even if it does, its quality is fair below par. Don't buy it! Instead, use the 10 minutes per day to meditate for free - you will have a much better effect.",
    "date": "2023-03-22T12:08:58.000Z"
  },
  {
    "rating": 5,
    "title": "Amazing product and great customer…",
    "review": "Amazing product and great customer service 🤩\nI have been using Mendi for over a month now and it is already helping me with my focus and sleep. I feel less stressed after my usual workday. I checked out some brain health wearables available in the market, Mendi is my favorite, the device is so easy to use and carry. And most importantly, it works.",
    "date": "2023-03-21T10:43:15.000Z"
  },
  {
    "rating": 5,
    "title": "Great device",
    "review": "Great device! I was skeptical at the beginning but after 8 weeks (exactly as stated in the manual) of everyday use and learning about Neurofeedback - I can admit that it works for me! Now it's hard to imagine life without those 10 minutes in the morning that makes me focused and productive every day. Great job Mendi! Looking forward to new features, devices, and discoveries in brain health!",
    "date": "2023-03-21T10:08:03.000Z"
  },
  {
    "rating": 5,
    "title": "Increased focus",
    "review": "LO\nLollo\nES\n•\n1 review\nMar 21, 2023\nIncreased focus\nDate of experience: March 21, 2023\nUseful\n1\nShare",
    "date": "2023-03-21T09:47:34.000Z"
  },
  {
    "rating": 5,
    "title": "My focus is so much better and I feel…",
    "review": "My focus is so much better and I feel more balanced",
    "date": "2023-03-21T09:43:47.000Z"
  },
  {
    "rating": 5,
    "title": "Great wearable neurotech device!",
    "review": "I knew neurofeedback has been shown in numerous studies to help with conditions such as anxiety and depression. After buying Mendi and following their recommended regime it has really helped me immeasurably to curb the intensity of my anxiety before sleep. I am excited about the product and the features that are promised!",
    "date": "2023-03-20T16:55:53.000Z"
  },
  {
    "rating": 5,
    "title": "Amazing product and support",
    "review": "EV\nEva\nES\n•\n2 reviews\nMar 20, 2023\nAmazing product and support\nDate of experience: March 16, 2023\nUseful\n2\nShare",
    "date": "2023-03-20T16:27:28.000Z"
  },
  {
    "rating": 5,
    "title": "Mendi is an excellent tool",
    "review": "Mendi is an excellent tool! I have tried many different types of EEG/braintech/neurotech but Mendi is my favorite. For example, I still use Muse but I must say Mendi i one (or two) steps better when to creating a relaxation and increased focus. Especially, having ADHD I have great help from using Mendi. Highly recommend to use it.",
    "date": "2023-03-20T15:53:36.000Z"
  },
  {
    "rating": 5,
    "title": "Positive effect on my focus…",
    "review": "Have seen a positive effect on my focus both at work and at home after only 4 months with Mendi. Professional app with good construction and clear instructions. Nice customer service with quick responses. Very worth the money, Recommend!",
    "date": "2023-03-10T15:40:40.000Z"
  },
  {
    "rating": 2,
    "title": "The app is poorly thought out",
    "review": "The app is poorly thought out. I've had mendi for two years and it's gotten worse. Nothing has improved. There are no new paths, just the usual ball rolling with the same music. If you want to consult the diary, the journal numbers overlap the words. The outline is obnoxious, resulting in a chaotic page with information that overlaps each other. Only the learning section is very accurate. Personally, after 6 months of use, I could only see a plateau in the device's effectiveness. Better than nothing, but it is not miraculous.",
    "date": "2023-03-10T11:41:17.000Z"
  },
  {
    "rating": 5,
    "title": "I stand by Mendi 100%",
    "review": "Pros\nI can stand by mendi 100% after a few days of using it I can feel different parts of my brain (specifically left prefrontal cortex at this stage). And im learning how to concentrate - I can feel my brain processing or learning and trying while its happening. In the app I indicated my mood felt better after a few sessions and looking up part of the brain region and it has to do with positive emotions. And something in my brain clicked and I just felt better and thought much lighter of a situation that was drama free.\n\nI compared them across several devices and they have cognitive Enhancement via focusing and other brain health benefits. Won't go for muse, returned apollo, it just vibrates will also get omniperf because it sends frequencies. And 100% keep mendi!\n\nIt also has a guest feature so I was sharing it with my brother.\n\nCons\n- customer service didn't get back to me on an inquiry before I bought it.\n- duty fees to Canada was $50 or $75 but I read reviews and was prepared for it.\n\nAdvice use paypal in case you need help with your order otherwise the device will arrive with duty fees to pay and its worth it!\n\nP.s. this review was not invited. Their CRM is not updated yet after buying I got an email with a discount to purchase it.",
    "date": "2023-03-01T05:55:40.000Z"
  },
  {
    "rating": 5,
    "title": "Amazing results",
    "review": "Note that I ordered the product from the US and had no need to try to return it so did not run into any of those issues. I have had the product right at a year, initially a few times a week and lately nearly every day (skip on Sundays a lot!). Initially I noticed improved creativity early on and that my mind was quieter - less cluttered. I later noticed after continued use I had vastly improved metacognition (thoughts about thoughts, essentially realizing what I am thinking at any given moment). This led to a recent breakthrough and subsequent newfound insight into long-term issues with anxiety that was leading to emotional thinking and reactivity as opposed to rational response in any given situation, especially one that was novel or anxiety provoking. I can now take any internal emotional \"temperature\" at any given moment (and remembering to do so!) and retain a state of calm with profoundly greater consistency.\n\nAlso for the first time I have been able to read rapidly without internal pronunciation of words. This was just discovered since I had fallen out of the habit of reading novels until just starting a course through work.\n\nI have deep gratitude for what Mendi has done for me and how it has improved my quality of life.",
    "date": "2023-01-24T05:52:30.000Z"
  },
  {
    "rating": 1,
    "title": "Watch out UK buyers",
    "review": "I am not sure about the actual device but my experience has not been positive\nI got a demanding letter from FedEx saying they wanted £46.00 for delivery\nI was shocked as Mendi say delivery is free\nIt turns out this charge is correct and somewhere there is something that tells you this. It would be more honest if they made it clear about this extra charge ( then I would not have ordered it).Customer service offered a partial refund of less than half of this but I am not happy. Not exactly free delivery in fact not at all free delivery",
    "date": "2023-01-16T19:28:39.000Z"
  },
  {
    "rating": 3,
    "title": "I cannot get a reply from this company",
    "review": "I cannot get a reply from this company! I’ve emailed the only email they have shown, at least 8 times in the last two weeks and still no reply. I am excited to try this Mendi device but I need to return this one I just received, as it is somewhat lopsided and doesn’t fit snug on one side of the forehead. I ordered another one- in hopes it will be symmetrical. But I need to return this and I’ve been trying to get ahold of them for almost two weeks and soon it will be past the 30 day return period!!!!!!",
    "date": "2022-11-02T16:31:02.000Z"
  },
  {
    "rating": 5,
    "title": "Absolutely fundamental for me to…",
    "review": "Absolutely fundamental for me to transform my health, both mental and physical after the tragic year of 2020. I was very sceptical of the promised benefits, but after consistent use of two weeks I FELT my \"third eye\" start to peak open. I have experienced all the promised benefits and it surpassed my expectations by a 100 miles. Can only be experienced first hand.",
    "date": "2022-08-23T22:03:36.000Z"
  },
  {
    "rating": 5,
    "title": "A great device that truly improves your mind",
    "review": "Biofeedback such as Mendi have evolved much thanks to better sensors. Unfortunately what programmers often forget is the user friendly aspect of a device. I have used other devices before Mendi and their worst feature was that the developer is often more concerned about collecting data for his company than provide the user with a friendly app. How can one concentrate or meditate if we are frustrated by that device? For a user like myself this is why I am now exclusively using Mendi and looking forward to my daily session. By user friendly I mean firstly the ease to connect, and more important, the ability to restart if we are not comfortable during calibration. Secondly if you decide to redo a session, the Mendi app will keep the best session. Last but not least the ease to contact a real person for support is very important. Users may take these features for granted but that it is not the case. These are the features that allow me to be relaxed when starting a gainful daily session with Mendi. I will recommend Mendi over any similar devices.\nMay I also suggest a fancy box for Mendi users?\nA warm thank you to all the staff for a true masterpiece.",
    "date": "2022-08-12T06:22:15.000Z"
  },
  {
    "rating": 4,
    "title": "It’s good but can improve",
    "review": "It’s good but can improve. I do feel more focused and relaxed, but sometimes the App logs you out and I need to restart my phone in order to log-in again, otherwise it stays as guest. Also need more stability, sometimes when playing the game, the ball starts going up and down very fast, and yes, I do follow the instructions (no direct light, do not disturb mode, etc.). But overall experience, is really good, it did change my habits for good.",
    "date": "2022-07-29T20:08:23.000Z"
  },
  {
    "rating": 3,
    "title": "After usingI have noticed a little more relaxation and focus, but",
    "review": "After using it for two weeks I have noticed a little more relaxed and focused. I know there will be a lot of updates, but compared to other machines this does only one thing. Like( Neo Ryhtm) does a lot of different\nthings for what your trying to achieve,it's cheaper and they give you 2 months to try it.",
    "date": "2022-07-17T15:35:41.000Z"
  },
  {
    "rating": 5,
    "title": "Highly recommend to anyone",
    "review": "Great device for shaping the only tool you really have in life, your brain. I have used Mendi for well over a month now and I can say that once you pass the initial learning curve there are definitive benefits to this, I feel more relaxed and focused and seem to have better impulse control. It’s very similar to mindfulness where you focus on your breath for example, except you can see in real time if you are doing it right. The app is not perfect but the team behind it are often updating with new features and fixes.",
    "date": "2022-07-17T03:49:47.000Z"
  },
  {
    "rating": 2,
    "title": "enjoyable but not effective",
    "review": "I purchased this product because I have ADHD but am unable to get medication where I live. While I enjoy using the Mendi headset and playing the little game, it has yet to have any effect on my concentration, habits, or any of the other things it promises to improve.",
    "date": "2022-07-15T22:12:07.000Z"
  },
  {
    "rating": 4,
    "title": "Good product! With margin of improvement!",
    "review": "I love the product, and I can see improvement when I use it but I feel like right now since it's still on his early phase is not very precise and it lacks some features on the app. But I really believe in the product and the company! For me, it helped improve my focus so I can say I'm satisfied to be part of the early adopters!",
    "date": "2021-12-17T12:06:12.000Z"
  }
]